{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"b_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_1", "W_regularizer": null, "bias": true, "nb_col": 3, "trainable": true, "border_mode": "valid", "activity_regularizer": null, "nb_row": 3, "init": "glorot_uniform", "batch_input_shape": [null, 28, 28, 1], "W_constraint": null, "activation": "linear", "b_constraint": null, "input_dtype": "float32", "subsample": [1, 1], "nb_filter": 32}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "W_regularizer": null, "bias": true, "name": "convolution2d_2", "trainable": true, "border_mode": "valid", "activity_regularizer": null, "nb_row": 3, "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "b_constraint": null, "subsample": [1, 1], "nb_filter": 32}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_1", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_1", "W_regularizer": null, "trainable": true, "activity_regularizer": null, "output_dim": 128, "bias": true, "input_dim": null, "W_constraint": null, "activation": "linear", "b_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_2", "W_regularizer": null, "trainable": true, "activity_regularizer": null, "output_dim": 10, "bias": true, "input_dim": null, "W_constraint": null, "activation": "linear", "b_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_4"}}], "keras_version": "1.1.1"}